#+TITLE Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

*Use M-x org-babel-tangle or use the binding C-c C-v t*

** Structure Templates

#+BEGIN_SRC emacs-lisp

  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))

#+END_SRC

#+RESULTS:
: ((py . src python) (el . src emacs-lisp) (sh . src shell) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))

